{
  "version": "0.0.1",
  "!!model": {
    "text": "",
    "end": {
      "type": ""
    }
  },
  "start of the game": {
    "text": "It is very dark. Cold and dark. You find yourself on an unfamiliar place at who knows what hours of the night, but you don't feel trapped at all. After all, you recall walking here by yourself earlier and could easily repeat it in reverse.\nBut, you're not so sure WHY you're here, and that frightens you. A whim? Did you just wander for hours without destination and just now noticed how lost you may be? Was this just an evening walk with one too many turns? The fact you can't remember how you got here unnerves you a lot more than your present location.\nYou should try to relax, you tell to yourself, no good decisions come from under stress. As your eyes slowly get used to the darkness, you decide to look up at the night sky. Just for a bit. If not to admire how many stars you can see here, whenever you are. And seeing them does help to ease, to reassure you truly aren't trapped away in some dark cave or something.\nYou focus on your hearing to better your bearings, as your eyes are still lagging behind in usefulness. Tree leaves whistle as some soft wind passes by. Crickets pepper the air all around, an owl hoots in the distance. And as seemingly far, you can listen to an occasional chugging of... car wheels on asphalt? Okay, that's good, there must be a road nearby! It seemed to come from your %c0%left%e%!\nThe black outlines that surround you are not more than pine trees. And the hardness bellow your feet is of a dirt path you're in. You feel a bit more relieved at the tranquillity around you and the muted sounds of civilization, not too far away.\nWelp, you should probably get going. Or do something else than standing around in the adumbrate. What are you going to do?",
    "colors": ["rgb(87, 210, 74)"],
    "end": {
      "type": "script",
      "script": {
        "key": "fakeInput"
      }
    }
  },
  "fake input: blank": {
    "text": "Well, seems you were too aghast to conjur what to do in these few seconds.\nMaybe as a helpful hint from within yourself, dressed up in a %c0%smelly%e% package, your mind gets consumed by a splitting headache before resuming an abrupt calm as words fill your thoughts. Commands on what to do next. Well that's helpful, you think, and listen closer to them.",
    "colors": ["yellow"],
    "end": {
      "type": "forced",
      "scenes": [{"key": "forest clearing"}]
    }
  },
  "fake input: speedy blank": {
    "text": "You were in such a hurry on to do something that you forgot to decide on what to do beforehand. This ends up with you just standing dumbfounded with extreme intensity.\nMaybe too intensely, as confusion lead to a small headache that let to clearmindness, together with a stream of ideas coming from nothing into you. You guess you just best follow these instead of doing nothing for the rest of the evening.",
    "end": {
      "type": "forced",
      "scenes": [{"key": "forest clearing"}]
    }
  },
  "fake input: normal": {
    "text": "While you pondered your first step on your daring escape, your mind suddenly blanks itself out of your own concepts, before others join in an unwelcome flood. You curl up slightly as your mind throbs with commands, under a very intense and sudden headache.\nThe headache passes about as soon as it came, but the alien thoughts refuse to shake out. You sigh and decide to humour them. You are weirdly calm about this situation.",
    "end": {
      "type": "forced",
      "scenes": [{"key": "forest clearing"}]
    }
  },
  "fake input: speedy normal": {
    "text": "You decide to do exactly that.\nOr, well, that was what you planned. What happened instead was that as soon as you felt your mind cogs click into motivated motion, they jammed right back up. A sense of dread and confusion fills you for a split second, leaving your mind blank of whatever you were planning to do. Bummer.\nInstead, from the splitting pain came a waterfall of ideas that fill your head, as if something within you decided to take realms and bark orders at you. You are frankly upset about this, but that too dissipates to a feeling of calmness about the situation.\nYou resign to follow your inner voice, less it gets bossy, or worse, your head decides to split in half again.",
    "end": {
      "type": "forced",
      "scenes": [{"key": "forest clearing"}]
    }
  },
  "forest clearing": {
    "text": "",
    "end": {
      "type": "choice",
      "choices": [{
          "key": "check surroundings in forest clearing",
          "text": "Look around the surroundings"
        },
        {
          "key": "glaze at the sky",
          "text": "Look up"
        },
        {
          "key": "glaze at the sky",
          "text": "Look up"
        },
        {
          "key": "forest clearing -> bus station, blind 1",
          "text": "Go left",
          "color": "rgb(87, 210, 74)"
        },
        {
          "key": "check inventory",
          "text": "Check your inventory",
          "color": "yellow"
        }]
    }
  },
  "check surroundings in forest clearing": {
    "text": "With your eyes finally used to the darkness of the night, you can kinda see what surrounds you in the moment. Alright, let's do the inventory.\nTrees.\nMore trees.\nEven more trees, these ones are shorter!\nA rock.\nYet more trees.\nThe floor, which is a mixture of loose gravel and short grass.\nYou forgot to mention to yourself all the trees are pine trees, too. Expect that one, you're not quite sure what it is, but the branches are too thick to be a pine tree, and the needle leaves too sparce.\nOh, okay, you were wrong, that one \"tree\" is actually a signpost. Talk about convenient.",
    "end": {
      "type": ""
    }
  }
}
